---
kind: property
id: P:Autodesk.Revit.DB.Family.CurtainPanelHorizontalSpacing
zh: 族
source: html/4dc5e3ce-5241-551b-e27b-f488d4f87269.htm
---
# Autodesk.Revit.DB.Family.CurtainPanelHorizontalSpacing Property

**中文**: 族

For Curtain Panel families, the horizontal spacing of the
driving mesh.

## Syntax (C#)
```csharp
public double CurtainPanelHorizontalSpacing { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown if this family is not the owner family of a curtain panel family document.